"""
BYTELANG 5 — Техническая документация

1. Типы файлов:
    — .bl — текстовый файл исходного байткода
    — .blc — скомпилированный байткод

2. Ограничение на одну команду в строке:
    каждая команда должна быть записана в отдельной строке.

3. Комментарии:
    Для добавления комментариев используется символ «;». Пример:
    ; Это комментарий

4. Директивы:
    Директивы используются для выполнения специальных функций.
    Формат директивы: .directive arg1 arg2
    Пример:.directive arg1 arg2

5. Команды:
    Команды выполняют определенные действия.
    Формат команды: command_name arg1 arg2
    Пример:
    command_name arg1 arg2

6. Метки:
    Метки используются для обозначения определенных точек в коде.
    Формат метки: mark:
    Пример:
    mark:

7. Строки:
    Строки могут быть встроены в код.
    Формат строки: «string»
    Пример: «Это строка»
"""


def compileBL(source: str) -> bytes:

    

    pass
